Tekla.Structures.Dialog.UIControls.ModelAccess
The ModelAccess class contains helper methods for connecting to and accessing the model and objects in the model.
The class attempts to provide efficient but robust methods for connecting to and verifying the connection to the model.

Tekla.Structures.Dialog.UIControls.ModelAccess.ConnectToModel
Gets a model connnection.
Returns: The model or null if unable to connect.

Tekla.Structures.Dialog.UIControls.ModelAccess.ConnectToModel(Tekla.Structures.Model.Model@)
Gets a model connection.
model: The model connection.
Returns: True on success. False otherwise.

Tekla.Structures.Dialog.UIControls.ModelAccess.ConnectToModel(System.Boolean@)
Gets a model connection.
ConnectedToModel: True if a model connection was made. False otherwise.
Returns: The model or null if unable to connect.